AigisYangyan/2026_NUEDC/board.syscfg
UART3.enableFIFO                        = true;
UART3.enabledDMATXTriggers              = "DL_UART_DMA_INTERRUPT_TX";
UART3.enabledDMARXTriggers              = "DL_UART_DMA_INTERRUPT_RX";
UART3.enabledInterrupts                 = ["DMA_DONE_RX","DMA_DONE_TX"];
UART3.targetBaudRate                    = 230400;
UART3.$name                             = "UART_VISION";
UART3.peripheral.$assign                = "UART1";
UART3.peripheral.rxPin.$assign          = "PA9";
UART3.peripheral.txPin.$assign          = "PA8";
UART3.txPinConfig.direction             = scripting.forceWrite("OUTPUT");
UART3.txPinConfig.hideOutputInversion   = scripting.forceWrite(false);
UART3.txPinConfig.onlyInternalResistor  = scripting.forceWrite(false);
UART3.txPinConfig.passedPeripheralType  = scripting.forceWrite("Digital");
UART3.txPinConfig.$name                 = "ti_driverlib_gpio_GPIOPinGeneric6";
UART3.rxPinConfig.hideOutputInversion   = scripting.forceWrite(false);
UART3.rxPinConfig.onlyInternalResistor  = scripting.forceWrite(false);
UART3.rxPinConfig.passedPeripheralType  = scripting.forceWrite("Digital");
UART3.rxPinConfig.$name                 = "ti_driverlib_gpio_GPIOPinGeneric9";
UART3.DMA_CHANNEL_TX.addressMode        = "b2f";
UART3.DMA_CHANNEL_TX.srcLength          = "BYTE";
UART3.DMA_CHANNEL_TX.dstLength          = "BYTE";
UART3.DMA_CHANNEL_TX.srcIncrement       = "INCREMENT";
UART3.DMA_CHANNEL_TX.enableInterrupt    = true;
UART3.DMA_CHANNEL_TX.$name              = "DMA_CH8";
UART3.DMA_CHANNEL_TX.peripheral.$assign = "DMA_CH5";
UART3.DMA_CHANNEL_RX.$name              = "DMA_CH7";
UART3.DMA_CHANNEL_RX.addressMode        = "f2b";
UART3.DMA_CHANNEL_RX.srcLength          = "BYTE";
UART3.DMA_CHANNEL_RX.dstLength          = "BYTE";
UART3.DMA_CHANNEL_RX.enableInterrupt    = true;
UART3.DMA_CHANNEL_RX.peripheral.$assign = "DMA_CH1";
scripting.suppress("Source Increment is controlled by the Source Address Direction configurable\\.", UART3.DMA_CHANNEL_TX, "srcIncDec");

UART4.$name                            = "UART_IMU";
/* 单轴 IMU 模组：用户 2026-07-17 裁定链路提速至 230400 + 500 Hz（P8B）。
 * 依据是云台前馈延迟 —— 180°/s 转弯时 200 Hz 的 5 ms 数据龄带来 0.90° 指向
 * 误差，是器件自身 0.2° 航向精度的 4.5 倍；500 Hz 压到 0.36°，同量级。
 * 500 Hz @230400 = 21.7% 线路占用、5000 次/秒逐字节中断（约 0.63% CPU）。
 * 模组出厂为 115200，**须由用户用厂商上位机改成 230400**：手册 BAUD 表把
 * 0x0006 同时标注为 115200 与 230400，230400 编码无可靠记载，固件不下发该命令。 */
UART4.targetBaudRate                   = 230400;
UART4.enableFIFO                       = true;
/* IMU 无 DMA 通道，RX 走逐字节中断：阈值取 1 才能让每个字节都触发。 */
UART4.enabledInterrupts                = ["RX"];
UART4.rxFifoThreshold                  = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART4.txFifoThreshold                  = "DL_UART_TX_FIFO_LEVEL_1_4_EMPTY";
UART4.peripheral.$assign               = "UART3";
UART4.peripheral.rxPin.$assign         = "PA25";
UART4.peripheral.txPin.$assign         = "PA26";
UART4.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART4.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART4.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART4.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART4.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric12";
UART4.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART4.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART4.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART4.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric13";

/* UART_BSL_ENTRY = 无线 BSL 烧录口（脚本变量 UART5 → 物理外设 UART0）。
 * 波特率 9600 是 ROM BSL 的固定值，非可调项：SDK bsl_uart_flash_interface
 * 定义 BSL_UART_DEFAULT_BAUD=9600，且 TI 的 BSL GUI 把 baudrate=9600 写死。
 * PA10/PA11 亦为 ROM BSL 固定引脚。
 *
 * 无 DMA、RX 逐字节中断：本口运行期只需接收上位机的 ENTRY 字节 0x22 触发软件跳
 * BSL（参考 SDK bsl_software_invoke_app_demo_uart），单字节事件不值得占用 DMA 通道。
 * ENTRY 监听器已落地（契约 D14，driver/bsl_entry）：IRQ handler 在 mspm0_runtime.c
 * 的 UART_BSL_ENTRY_INST_IRQHandler，NVIC 使能在 driver/board/board.c，
 * 阈值取 1 让每个字节都触发（同 UART_IMU）——不再落 startup 默认死循环。 */
UART5.$name                            = "UART_BSL_ENTRY";
UART5.targetBaudRate                   = 9600;
UART5.enableFIFO                       = true;
UART5.enabledInterrupts                = ["RX"];
UART5.rxFifoThreshold                  = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART5.peripheral.$assign               = "UART0";
UART5.peripheral.rxPin.$assign         = "PA11";
UART5.peripheral.txPin.$assign         = "PA10";
UART5.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART5.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART5.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART5.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART5.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric18";
UART5.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART5.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART5.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART5.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric19";
